Tekla Open API Reference for Tekla Structures 2025
AnalysisArea.InnerPositions Property
 Gets or sets the inner positions of the analysis area.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<AnalysisPosition> InnerPositions { get; set; }
Public Property InnerPositions As List(Of AnalysisPosition)
	Get
	Set
Property Value
Type: List<AnalysisPosition>
See Also
Reference
AnalysisArea Class
Tekla.Structures.Analysis Namespace